[
  {
    "id": "step1",
    "label": "Фокус",
    "title": "На что вы хотите обратить внимание в своем предложении?",
    "hint": "Выбор фокуса предложения поможет определить, в каком залоге (активном или пассивном) его нужно строить, или нужно ли использовать условную конструкцию.",
    "options": [
      {
        "value": "actor",
        "icon": "👤",
        "title": "На того, кто совершает действие",
        "description": "Акцент на исполнителе действия",
        "hint": "Вы выбрали <strong>активный залог</strong>. В активном залоге подлежащее выполняет действие. <div class=\"example\"><strong>Примеры:</strong><br>\"Я читаю книгу.\"<br>\"Студенты выполнили задание.\"<br>\"Мы будем изучать новую тему.\"</div>"
      },
      {
        "value": "object",
        "icon": "📦",
        "title": "На то, что происходит с объектом",
        "description": "Акцент на объекте действия",
        "hint": "Вы выбрали <strong>пассивный залог</strong>. В пассивном залоге акцент делается на действии, которое совершается над объектом. <div class=\"example\"><strong>Примеры:</strong><br>\"Книга читается мной.\"<br>\"Задание было выполнено студентами.\"<br>\"Новая тема будет изучаться нами.\"</div>"
      },
      {
        "value": "condition",
        "icon": "🔄",
        "title": "На взаимосвязь между условием и результатом",
        "description": "Конструкция \"если..., то...\"",
        "hint": "Вы выбрали <strong>условное предложение</strong>. Конструкция \"если..., то...\" помогает выразить зависимость одного действия от другого. <div class=\"example\"><strong>Примеры:</strong><br>\"Если пойдет дождь, я возьму зонт.\"<br>\"Если бы у меня было больше времени, я бы прочитал эту книгу.\"<br>\"Если бы я знал ответ, я бы сказал тебе.\"</div>"
      }
    ]
  },
  {
    "id": "step2",
    "label": "Время",
    "title": "Когда происходит (произошло/произойдет) действие?",
    "canBeSkipped": true,
    "skipMessage": "Для условных предложений выбор времени не требуется",
    "hint": "Временной период действия - один из ключевых факторов при выборе грамматического времени в английском языке. Выберите, когда происходит ваше действие.",
    "options": [
      {
        "value": "past",
        "icon": "⏮️",
        "title": "В прошлом",
        "description": "Действие уже завершилось",
        "hint": "Вы выбрали <strong>прошедшее время</strong>. На следующем этапе мы определим, какое именно прошедшее время подходит для вашего случая.<div class=\"example\"><strong>Past Simple:</strong> \"Я прочитал книгу вчера.\"<br><strong>Past Continuous:</strong> \"Я читал книгу, когда позвонил друг.\"<br><strong>Past Perfect:</strong> \"Я уже прочитал книгу до того, как посмотрел фильм.\"<br><strong>Past Perfect Continuous:</strong> \"Я читал книгу 2 часа до его прихода.\"</div>"
      },
      {
        "value": "present",
        "icon": "⏯️",
        "title": "В настоящем",
        "description": "Действие происходит сейчас или регулярно",
        "hint": "Вы выбрали <strong>настоящее время</strong>. На следующем этапе мы определим, какое именно настоящее время подходит для вашего случая.<div class=\"example\"><strong>Present Simple:</strong> \"Я читаю книги по вечерам.\"<br><strong>Present Continuous:</strong> \"Я сейчас читаю интересную книгу.\"<br><strong>Present Perfect:</strong> \"Я уже прочитал 100 страниц.\"<br><strong>Present Perfect Continuous:</strong> \"Я читаю эту книгу уже неделю.\"</div>"
      },
      {
        "value": "future",
        "icon": "⏭️",
        "title": "В будущем",
        "description": "Действие произойдет позже",
        "hint": "Вы выбрали <strong>будущее время</strong>. В английском языке существует несколько способов выразить будущее время.<div class=\"example\"><strong>Future Simple (will):</strong> \"Я позвоню тебе завтра.\"<br><strong>Be going to:</strong> \"Я собираюсь навестить родителей в эти выходные.\"<br><strong>Present Continuous для будущего:</strong> \"Я встречаюсь с друзьями в субботу.\"<br><strong>Present Simple для будущего:</strong> \"Поезд отправляется в 9 утра.\"</div>"
      }
    ]
  },
  {
    "id": "step3_actor_future",
    "label": "Характер",
    "title": "Как вы представляете это будущее действие?",
    "hint": "В английском языке существует несколько способов выразить будущее время. Выбор зависит от характера действия и контекста.",
    "options": [
      {
        "value": "prediction",
        "icon": "🔮",
        "title": "Предсказание или спонтанное решение",
        "description": "Решение принимается сейчас или это предположение о будущем",
        "hint": "Вы выбрали <strong>Future Simple</strong> (will + глагол). Используется для предсказаний и спонтанных решений, принимаемых в момент речи.<div class=\"example\">\"I will call you tomorrow.\" (Я позвоню тебе завтра)<br>\"I think it will rain later.\" (Я думаю, позже пойдет дождь)<br>\"Don't worry, I'll help you with this.\" (Не волнуйся, я помогу тебе с этим)</div>"
      },
      {
        "value": "intention",
        "icon": "🎯",
        "title": "Намерение или план",
        "description": "Решение было принято ранее, есть намерение выполнить действие",
        "hint": "Вы выбрали <strong>be going to</strong> (am/is/are going to + глагол). Используется для выражения намерений и планов, решение о которых было принято заранее.<div class=\"example\">\"I am going to study tonight.\" (Я собираюсь заниматься сегодня вечером)<br>\"They are going to move to a new house.\" (Они собираются переехать в новый дом)<br>\"She is going to apply for that job.\" (Она собирается подать заявление на ту работу)</div>"
      },
      {
        "value": "arrangement",
        "icon": "📅",
        "title": "Запланированная договоренность",
        "description": "Конкретная договоренность в ближайшем будущем",
        "hint": "Вы выбрали <strong>Present Continuous для будущего</strong> (am/is/are + глагол-ing). Используется для запланированных договоренностей в ближайшем будущем.<div class=\"example\">\"I am meeting my friends this weekend.\" (Я встречаюсь с друзьями в эти выходные)<br>\"She is flying to Paris on Monday.\" (Она летит в Париж в понедельник)<br>\"We are having dinner with my parents tomorrow.\" (Мы ужинаем с моими родителями завтра)</div>"
      },
      {
        "value": "schedule",
        "icon": "🕒",
        "title": "Действие по расписанию",
        "description": "Фиксированное расписание или официальный график",
        "hint": "Вы выбрали <strong>Present Simple для будущего</strong> (глагол в настоящем времени). Используется для действий по фиксированному расписанию.<div class=\"example\">\"The train leaves at 5 PM.\" (Поезд отправляется в 5 вечера)<br>\"The meeting starts at 10 AM tomorrow.\" (Собрание начинается завтра в 10 утра)<br>\"The exam finishes at noon.\" (Экзамен заканчивается в полдень)</div>"
      },
      {
        "value": "inProgress",
        "icon": "⏳",
        "title": "Действие в процессе в конкретный момент будущего",
        "description": "Акцент на процессе в определённый момент",
        "hint": "Вы выбрали <strong>Future Continuous</strong> (will be + глагол-ing). Используется для действий, которые будут происходить в определенный момент в будущем.<div class=\"example\">\"This time tomorrow I will be flying to London.\" (Завтра в это время я буду лететь в Лондон)<br>\"She will be working all day tomorrow.\" (Она будет работать весь день завтра)<br>\"Will you be using the car tonight?\" (Ты будешь пользоваться машиной сегодня вечером?)</div>"
      },
      {
        "value": "completed",
        "icon": "✅",
        "title": "Действие, которое завершится к определенному моменту",
        "description": "Акцент на завершенности к конкретному моменту",
        "hint": "Вы выбрали <strong>Future Perfect</strong> (will have + причастие прошедшего времени). Используется для действий, которые завершатся к определенному моменту в будущем.<div class=\"example\">\"I will have finished the project by Friday.\" (Я закончу проект к пятнице)<br>\"By next month, they will have built the new office.\" (К следующему месяцу они построят новый офис)<br>\"She will have graduated by June.\" (Она закончит учебу к июню)</div>"
      },
      {
        "value": "duration",
        "icon": "⏱️",
        "title": "Длительное действие с продолжительностью до момента",
        "description": "Действие началось и будет продолжаться до определенного момента",
        "hint": "Вы выбрали <strong>Future Perfect Continuous</strong> (will have been + глагол-ing). Используется для длительных действий, которые будут продолжаться до определенного момента в будущем.<div class=\"example\">\"By December, I will have been working on this project for 6 months.\" (К декабрю я буду работать над этим проектом уже 6 месяцев)<br>\"Next week, they will have been living here for 10 years.\" (На следующей неделе они будут жить здесь уже 10 лет)<br>\"By the time you arrive, I will have been waiting for 2 hours.\" (К тому времени, как ты приедешь, я буду ждать уже 2 часа)</div>"
      }
    ]
  },
  {
    "id": "step3_actor_present",
    "label": "Характер",
    "title": "Как бы вы описали это настоящее действие?",
    "hint": "В английском языке есть четыре основных времени для описания действий в настоящем. Выбор зависит от характера и продолжительности действия.",
    "options": [
      {
        "value": "regular",
        "icon": "📊",
        "title": "Регулярное действие или общая истина",
        "description": "Действие происходит регулярно или это общеизвестный факт",
        "hint": "Вы выбрали <strong>Present Simple</strong> (глагол в базовой форме). Используется для регулярных действий и общих истин.<div class=\"example\">\"I read books every evening.\" (Я читаю книги каждый вечер)<br>\"She works in a hospital.\" (Она работает в больнице)<br>\"Water boils at 100 degrees Celsius.\" (Вода кипит при 100 градусах Цельсия)</div>"
      },
      {
        "value": "inProgress",
        "icon": "⏳",
        "title": "Действие происходит сейчас или временно",
        "description": "Действие в процессе выполнения или временное",
        "hint": "Вы выбрали <strong>Present Continuous</strong> (am/is/are + глагол-ing). Используется для действий, происходящих в данный момент или временных ситуаций.<div class=\"example\">\"I am reading an interesting book now.\" (Я сейчас читаю интересную книгу)<br>\"She is working on a new project this month.\" (Она работает над новым проектом в этом месяце)<br>\"They are staying with friends until they find an apartment.\" (Они живут у друзей, пока не найдут квартиру)</div>"
      },
      {
        "value": "completed",
        "icon": "✅",
        "title": "Действие началось в прошлом и имеет результат или связь с настоящим",
        "description": "Акцент на результате завершенного действия",
        "hint": "Вы выбрали <strong>Present Perfect</strong> (have/has + причастие прошедшего времени). Используется для действий, завершившихся в прошлом, но имеющих связь с настоящим.<div class=\"example\">\"I have already read 100 pages.\" (Я уже прочитал 100 страниц)<br>\"She has visited Paris three times.\" (Она посетила Париж три раза)<br>\"Have you ever tried sushi?\" (Ты когда-нибудь пробовал суши?)</div>"
      },
      {
        "value": "duration",
        "icon": "⏱️",
        "title": "Действие началось в прошлом и продолжается до сих пор",
        "description": "Акцент на продолжительности незавершенного действия",
        "hint": "Вы выбрали <strong>Present Perfect Continuous</strong> (have/has been + глагол-ing). Используется для действий, которые начались в прошлом и продолжаются до сих пор.<div class=\"example\">\"I have been reading this book for a week.\" (Я читаю эту книгу уже неделю)<br>\"She has been working here since 2015.\" (Она работает здесь с 2015 года)<br>\"How long have you been waiting?\" (Как долго ты ждешь?)</div>"
      }
    ]
  },
  {
    "id": "step3_actor_past",
    "label": "Характер",
    "title": "Как бы вы описали это прошедшее действие?",
    "hint": "В английском языке есть четыре основных времени для описания действий в прошлом. Выбор зависит от характера, продолжительности и последовательности действий.",
    "options": [
      {
        "value": "simple",
        "icon": "📅",
        "title": "Простое законченное действие",
        "description": "Действие произошло и завершилось в прошлом",
        "hint": "Вы выбрали <strong>Past Simple</strong> (глагол в форме прошедшего времени). Используется для действий, которые произошли и завершились в прошлом.<div class=\"example\">\"I read that book last month.\" (Я прочитал эту книгу в прошлом месяце)<br>\"She visited her grandmother yesterday.\" (Она навестила свою бабушку вчера)<br>\"They bought a new car last year.\" (Они купили новую машину в прошлом году)</div>"
      },
      {
        "value": "inProgress",
        "icon": "⏳",
        "title": "Действие было в процессе в определенный момент",
        "description": "Действие происходило в конкретный момент прошлого",
        "hint": "Вы выбрали <strong>Past Continuous</strong> (was/were + глагол-ing). Используется для действий, которые происходили в определенный момент в прошлом.<div class=\"example\">\"I was reading when the phone rang.\" (Я читал, когда зазвонил телефон)<br>\"She was working all day yesterday.\" (Она работала весь день вчера)<br>\"What were you doing at 8 PM last night?\" (Что ты делал вчера в 8 вечера?)</div>"
      },
      {
        "value": "before",
        "icon": "✅",
        "title": "Действие произошло до другого действия в прошлом",
        "description": "Завершенное действие перед другим действием в прошлом",
        "hint": "Вы выбрали <strong>Past Perfect</strong> (had + причастие прошедшего времени). Используется для действий, которые произошли до другого момента или действия в прошлом.<div class=\"example\">\"I had already read the book before I watched the movie.\" (Я уже прочитал книгу до того, как посмотрел фильм)<br>\"She had never visited Paris before her trip last summer.\" (Она никогда не была в Париже до своей поездки прошлым летом)<br>\"By the time he arrived, we had finished dinner.\" (К тому времени, как он прибыл, мы уже закончили ужин)</div>"
      },
      {
        "value": "duration",
        "icon": "⏱️",
        "title": "Действие длилось определенное время до момента в прошлом",
        "description": "Акцент на продолжительности действия до определенного момента",
        "hint": "Вы выбрали <strong>Past Perfect Continuous</strong> (had been + глагол-ing). Используется для действий, которые продолжались некоторое время до определенного момента в прошлом.<div class=\"example\">\"I had been reading for 2 hours before I fell asleep.\" (Я читал 2 часа, прежде чем заснул)<br>\"She had been working here for 5 years when she got promoted.\" (Она работала здесь 5 лет, когда получила повышение)<br>\"How long had you been waiting before the bus arrived?\" (Как долго ты ждал до того, как приехал автобус?)</div>"
      }
    ]
  },
  {
    "id": "step3_object_future",
    "label": "Характер",
    "title": "Как вы представляете это будущее действие с объектом?",
    "hint": "В пассивном залоге для будущего времени чаще всего используются две формы: Future Simple Passive и Future Perfect Passive.",
    "options": [
      {
        "value": "simple",
        "icon": "📦",
        "title": "Простое действие в будущем",
        "description": "Действие произойдет с объектом в будущем",
        "hint": "Вы выбрали <strong>Future Simple Passive</strong> (will be + причастие прошедшего времени). Используется для простых действий, которые произойдут с объектом в будущем.<div class=\"example\">\"The letter will be sent tomorrow.\" (Письмо будет отправлено завтра)<br>\"The building will be renovated next year.\" (Здание будет отремонтировано в следующем году)<br>\"Will the problem be solved soon?\" (Проблема будет решена скоро?)</div>"
      },
      {
        "value": "completed",
        "icon": "✅",
        "title": "Действие, которое завершится с объектом к определенному моменту",
        "description": "Акцент на завершенности действия к конкретному моменту",
        "hint": "Вы выбрали <strong>Future Perfect Passive</strong> (will have been + причастие прошедшего времени). Используется для действий, которые будут завершены с объектом к определенному моменту в будущем.<div class=\"example\">\"The report will have been completed by Monday.\" (Отчет будет завершен к понедельнику)<br>\"All tickets will have been sold out by the time we arrive.\" (Все билеты будут распроданы к тому времени, как мы прибудем)<br>\"The new bridge will have been built by the end of next year.\" (Новый мост будет построен к концу следующего года)</div>"
      }
    ]
  },
  {
    "id": "step3_object_present",
    "label": "Характер",
    "title": "Как бы вы описали это настоящее действие с объектом?",
    "hint": "В пассивном залоге для настоящего времени используются три основные формы: Present Simple Passive, Present Continuous Passive и Present Perfect Passive.",
    "options": [
      {
        "value": "regular",
        "icon": "📊",
        "title": "Регулярное действие или общая истина",
        "description": "Действие происходит с объектом регулярно или это общеизвестный факт",
        "hint": "Вы выбрали <strong>Present Simple Passive</strong> (am/is/are + причастие прошедшего времени). Используется для регулярных действий и общих истин в пассивном залоге.<div class=\"example\">\"The museum is visited by thousands of people every day.\" (Музей посещается тысячами людей каждый день)<br>\"These cars are made in Germany.\" (Эти автомобили производятся в Германии)<br>\"English is spoken in many countries.\" (Английский язык используется во многих странах)</div>"
      },
      {
        "value": "inProgress",
        "icon": "⏳",
        "title": "Действие происходит с объектом сейчас",
        "description": "Действие в процессе выполнения с объектом или временное",
        "hint": "Вы выбрали <strong>Present Continuous Passive</strong> (am/is/are being + причастие прошедшего времени). Используется для действий, происходящих с объектом в данный момент.<div class=\"example\">\"The house is being painted right now.\" (Дом сейчас красится)<br>\"The issue is being discussed at the meeting.\" (Проблема обсуждается на собрании)<br>\"The patient is being examined by the doctor.\" (Пациент осматривается врачом)</div>"
      },
      {
        "value": "completed",
        "icon": "✅",
        "title": "Действие с объектом имеет результат или связь с настоящим",
        "description": "Акцент на результате завершенного действия с объектом",
        "hint": "Вы выбрали <strong>Present Perfect Passive</strong> (have/has been + причастие прошедшего времени). Используется для действий, завершившихся с объектом, но имеющих связь с настоящим.<div class=\"example\">\"The report has been completed.\" (Отчет был завершен)<br>\"The letter has been sent to all employees.\" (Письмо было отправлено всем сотрудникам)<br>\"Has the problem been solved yet?\" (Проблема уже была решена?)</div>"
      }
    ]
  },
  {
    "id": "step3_object_past",
    "label": "Характер",
    "title": "Как бы вы описали это прошедшее действие с объектом?",
    "hint": "В пассивном залоге для прошедшего времени используются три основные формы: Past Simple Passive, Past Continuous Passive и Past Perfect Passive.",
    "options": [
      {
        "value": "simple",
        "icon": "📅",
        "title": "Простое законченное действие с объектом",
        "description": "Действие произошло и завершилось с объектом в прошлом",
        "hint": "Вы выбрали <strong>Past Simple Passive</strong> (was/were + причастие прошедшего времени). Используется для действий, которые произошли и завершились с объектом в прошлом.<div class=\"example\">\"The letter was sent yesterday.\" (Письмо было отправлено вчера)<br>\"The building was constructed in 1985.\" (Здание было построено в 1985 году)<br>\"Was the project completed on time?\" (Был ли проект завершен вовремя?)</div>"
      },
      {
        "value": "inProgress",
        "icon": "⏳",
        "title": "Действие было в процессе с объектом в определенный момент",
        "description": "Действие происходило с объектом в конкретный момент прошлого",
        "hint": "Вы выбрали <strong>Past Continuous Passive</strong> (was/were being + причастие прошедшего времени). Используется для действий, которые происходили с объектом в определенный момент в прошлом.<div class=\"example\">\"The house was being painted when I arrived.\" (Дом красили, когда я приехал)<br>\"The issue was being discussed at the meeting.\" (Проблема обсуждалась на собрании)<br>\"While the patient was being examined, the doctor noticed something unusual.\" (Пока пациента осматривали, врач заметил что-то необычное)</div>"
      },
      {
        "value": "before",
        "icon": "✅",
        "title": "Действие с объектом произошло до другого действия в прошлом",
        "description": "Завершенное действие с объектом перед другим действием в прошлом",
        "hint": "Вы выбрали <strong>Past Perfect Passive</strong> (had been + причастие прошедшего времени). Используется для действий, которые произошли с объектом до другого момента или действия в прошлом.<div class=\"example\">\"The report had been completed before the meeting started.\" (Отчет был завершен до начала собрания)<br>\"The house had been sold before we made our offer.\" (Дом был продан до того, как мы сделали наше предложение)<br>\"By the time they arrived, the project had been finished.\" (К тому времени, как они прибыли, проект был завершен)</div>"
      }
    ]
  },
  {
    "id": "step3_condition",
    "label": "Характер",
    "title": "Какая ситуация лучше описывает ваше условие?",
    "hint": "В английском языке существует несколько типов условных предложений в зависимости от вероятности условия и времени.",
    "options": [
      {
        "value": "zero",
        "icon": "🌐",
        "title": "Общая истина или закономерность",
        "description": "Результат всегда следует за условием",
        "hint": "Вы выбрали <strong>Zero Conditional</strong> (if + Present Simple, Present Simple). Используется для общих истин и закономерностей.<div class=\"example\">\"If you heat water to 100°C, it boils.\" (Если нагреть воду до 100°C, она закипает)<br>\"If I eat chocolate, I get headaches.\" (Если я ем шоколад, у меня болит голова)<br>\"Plants die if they don't get water.\" (Растения умирают, если не получают воду)</div>"
      },
      {
        "value": "first",
        "icon": "1️⃣",
        "title": "Реальная возможность в будущем",
        "description": "Условие вполне возможно",
        "hint": "Вы выбрали <strong>First Conditional</strong> (if + Present Simple, will + инфинитив). Используется для вполне вероятных условий в будущем.<div class=\"example\">\"If it rains, I will stay at home.\" (Если пойдет дождь, я останусь дома)<br>\"She will call you if she has time.\" (Она позвонит тебе, если у нее будет время)<br>\"If we don't hurry, we will miss the train.\" (Если мы не поторопимся, мы опоздаем на поезд)</div>"
      },
      {
        "value": "second",
        "icon": "2️⃣",
        "title": "Маловероятная или нереальная ситуация в настоящем/будущем",
        "description": "Условие маловероятно или воображаемо",
        "hint": "Вы выбрали <strong>Second Conditional</strong> (if + Past Simple, would + инфинитив). Используется для маловероятных или воображаемых условий в настоящем или будущем.<div class=\"example\">\"If I had more time, I would read more books.\" (Если бы у меня было больше времени, я бы читал больше книг)<br>\"She would travel around the world if she were rich.\" (Она бы путешествовала по миру, если бы была богата)<br>\"What would you do if you won the lottery?\" (Что бы ты сделал, если бы выиграл в лотерею?)</div>"
      },
      {
        "value": "third",
        "icon": "3️⃣",
        "title": "Нереальная ситуация в прошлом",
        "description": "Условие не осуществилось в прошлом",
        "hint": "Вы выбрали <strong>Third Conditional</strong> (if + Past Perfect, would have + причастие прошедшего времени). Используется для нереальных условий в прошлом.<div class=\"example\">\"If I had known about the party, I would have come.\" (Если бы я знал о вечеринке, я бы пришел)<br>\"She would have passed the exam if she had studied harder.\" (Она бы сдала экзамен, если бы училась усерднее)<br>\"If the weather hadn't been so bad, we would have gone to the beach.\" (Если бы погода не была такой плохой, мы бы пошли на пляж)</div>"
      },
      {
        "value": "mixed",
        "icon": "🔄",
        "title": "Смешанное условие (разные времена)",
        "description": "Условие в одном времени, результат в другом",
        "hint": "Вы выбрали <strong>Mixed Conditional</strong>. Смешанные условные предложения объединяют элементы разных типов условных предложений.<div class=\"example\">\"If I had studied medicine, I would be a doctor now.\" (Если бы я изучал медицину (в прошлом), я был бы сейчас врачом)<br>\"If I weren't so tired, I would have gone to the party last night.\" (Если бы я не был таким уставшим (сейчас), я бы пошел на вечеринку вчера вечером)<br>\"She would have a better job now if she had finished university.\" (У нее была бы сейчас работа получше, если бы она закончила университет)</div>"
      }
    ]
  },
  {
    "id": "step4_form",
    "label": "Форма",
    "title": "Какую форму предложения вы хотите составить?",
    "canBeSkipped": true,
    "skipMessage": "Для условных предложений форма уже определена структурой",
    "hint": "Выбор формы предложения определяет структуру грамматической конструкции.",
    "options": [
      {
        "value": "affirmative",
        "icon": "✅",
        "title": "Утверждение",
        "description": "Я сообщаю информацию или факт",
        "hint": "Вы выбрали <strong>утвердительную форму</strong> предложения. Это базовая форма для сообщения фактов или информации."
      },
      {
        "value": "question",
        "icon": "❓",
        "title": "Вопрос",
        "description": "Я хочу получить информацию",
        "hint": "Вы выбрали <strong>вопросительную форму</strong> предложения. Эта форма используется, когда вы хотите запросить информацию."
      },
      {
        "value": "negative",
        "icon": "🚫",
        "title": "Отрицание",
        "description": "Я отрицаю факт или действие",
        "hint": "Вы выбрали <strong>отрицательную форму</strong> предложения. Эта форма используется, когда вы хотите отрицать факт или действие."
      }
    ]
  }
]